FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтрольЭлементовФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтрольЭлементовФорм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДокументОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КолонкаТаблЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоИсключение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПравИсключение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Пользователи системы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрав</Name>
					<Comment>Права берутся от другого пользователя, указанного в этом реквизите</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияОборудования</Name>
					<Comment>0 - обычный режим, 1 - локальное оборудование недоступно для других, 2 - запрещено любое использование оборудования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяШаблоном</Name>
					<Comment>Является шаблоном</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольККМ</Name>
					<Comment>пароль-идентификатор кассира при работе с КММ(ФР)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФункциональнойПанели</Name>
					<Comment>Настройка функциональной панели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФункциональнойПанели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинНаМобильномУстройстве</Name>
					<Comment>Логин на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольНаМобильномУстройстве</Name>
					<Comment>Пароль на мобильном устройстве</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиАРМОтчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиАРМОтчеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/М_КонтрольЭлементовФорм/Ext/Module.bsl
Процедура КонтрольЭлементовФормы(Форма,ТипФормы) Экспорт
	ОбъектДокумент = Форма.ЭтотОбъект.Метаданные().Имя;
	ПраваПользователя = глПрава;
	ШаблонПравПользователя = ПараметрыСеанса.Пользователь.ШаблонПрав;	
	
	ШаблонПрав = новый СписокЗначений;
	ШаблонПрав.Добавить(ШаблонПравПользователя);
	ШаблонПрав.Добавить(Справочники.Пользователи.ПустаяСсылка());
	
	Настройки = ПолучитьНастройкиЭлементов(ОбъектДокумент,ТипФормы,ШаблонПрав);
	
	Для Каждого Настройка из Настройки Цикл
		
				
		ПроверкаПоШаблонуПрав = ?(ЗначениеЗаполнено(Настройка.ШаблонПрав) Или ЗначениеЗаполнено(Настройка.ШаблонПравИсключение),Истина,Ложь);
		ПроверкаПоПравам = ?(ЗначениеЗаполнено(Настройка.Право) Или ЗначениеЗаполнено(Настройка.ПравоИсключение),Истина,Ложь);
		ПравилоДляВсехБезИсключений = ?(ПроверкаПоШаблонуПрав = Ложь И ПроверкаПоПравам = Ложь,Истина,Ложь);
				
		//Проверка по шаблону
		Если НЕ ПравилоДляВсехБезИсключений И ПроверкаПоШаблонуПрав тогда
			//Проверка на конкретный шаблон
			Если ЗначениеЗаполнено(Настройка.ШаблонПрав) И ШаблонПравПользователя <> Настройка.ШаблонПрав Тогда
				ПРодолжить; //Правило не подходит
			КонецЕсли;
			//Проверка на Исключение
			Если ЗначениеЗаполнено(Настройка.ШаблонПравИсключение) И ШаблонПравПользователя = Настройка.ШаблонПравИсключение Тогда
				ПРодолжить; //Правило не подходит
			КонецЕсли;
		КонецЕсли;
		
		//Проверка по Правам
		Если НЕ ПравилоДляВсехБезИсключений И ПроверкаПоПравам тогда
			//Проверка на конкретное право
			Если ЗначениеЗаполнено(Настройка.Право) И ЗначениеЗаполнено(обПраво(Настройка.Право,ПраваПользователя)) И обПраво(Настройка.Право,ПраваПользователя) = Ложь Тогда
				ПРодолжить; //Правило не подходит
			КонецЕсли;
			//Проверка на Исключение
			Если ЗначениеЗаполнено(Настройка.ПравоИсключение) И ЗначениеЗаполнено(обПраво(Настройка.ПравоИсключение,ПраваПользователя)) И обПраво(Настройка.ПравоИсключение,ПраваПользователя) = Ложь Тогда
				ПРодолжить; //Правило не подходит
			КонецЕсли;
		КонецЕсли;
			
		
		ТабличнаяЧастьЛи = Настройка.ТабличнаяЧасть;
		НаимЭлемента = Настройка.Элемент;
		
		СвойствоЭлемента = Настройка.Свойство;
		ЗначениеСвойства = Настройка.Значение;
		
		Если НЕ ЗначениеЗаполнено(СвойствоЭлемента) ИЛИ НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Продолжить;		
		КонецЕсли;
		
		Если ЗначениеСвойства = "Истина" тогда
			ЗначениеСвойства = Истина;
		ИначеЕсли ЗначениеСвойства = "Ложь" Тогда
			ЗначениеСвойства = ложь;             
		Иначе
			ЗначениеСвойства = Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СвойствоЭлемента) ИЛИ НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			Продолжить;		
		КонецЕсли;
		
		Элемент = ПолучитьЭлементНаФорме(Форма,НаимЭлемента);
		
		Если Элемент = Ложь Тогда
			Продолжить;		
		КонецЕсли;
		
		Если ТабличнаяЧастьЛи Тогда
			ИмяКолонки = Настройка.КолонкаТаблЧасти;
			Элемент = ПолучитьКолонкуТаблицы(Элемент,ИмяКолонки)
		КонецЕсли;
		
		Если Элемент = Ложь Тогда
			Продолжить;		
		КонецЕсли;
		
		УстановитьЗначениеСвойстваЭлемента(Элемент,СвойствоЭлемента,ЗначениеСвойства);
			
	КонецЦикла;
	
	
	
	
КонецПроцедуры 

Функция ПолучитьНастройкиЭлементов(Объект, ТипФормы, ШаблонПрав)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольЭлементовФорм.ДокументОбъект КАК ДокументОбъект,
		|	КонтрольЭлементовФорм.Форма КАК Форма,
		|	КонтрольЭлементовФорм.Активно КАК Активно,
		|	КонтрольЭлементовФорм.Элемент КАК Элемент,
		|	КонтрольЭлементовФорм.ТабличнаяЧасть КАК ТабличнаяЧасть,
		|	КонтрольЭлементовФорм.КолонкаТаблЧасти КАК КолонкаТаблЧасти,
		|	КонтрольЭлементовФорм.Свойство КАК Свойство,
		|	КонтрольЭлементовФорм.Значение КАК Значение,
		|	КонтрольЭлементовФорм.Право КАК Право,
		|	КонтрольЭлементовФорм.ШаблонПрав КАК ШаблонПрав,
		|	КонтрольЭлементовФорм.ПравоИсключение КАК ПравоИсключение,
		|	КонтрольЭлементовФорм.ШаблонПравИсключение КАК ШаблонПравИсключение
		|ИЗ
		|	РегистрСведений.КонтрольЭлементовФорм КАК КонтрольЭлементовФорм
		|ГДЕ
		|	КонтрольЭлементовФорм.Активно = ИСТИНА
		|	И КонтрольЭлементовФорм.ДокументОбъект = &ДокументОбъект
		|	И КонтрольЭлементовФорм.Форма = &Форма
		|	И КонтрольЭлементовФорм.ШаблонПрав В(&ШаблонПрав)";
	
	Запрос.УстановитьПараметр("ДокументОбъект", Объект);
	Запрос.УстановитьПараметр("Форма", ТипФормы);
	Запрос.УстановитьПараметр("ШаблонПрав", ШаблонПрав);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ПолучитьЭлементНаФорме(Форма,Элемент)
	Попытка
		Возврат Форма.ЭлементыФормы[Элемент];
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция ПолучитьКолонкуТаблицы(Таблица,ИмяКолонки)
	Попытка
		Возврат Таблица.Колонки[ИмяКолонки];
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции 

Функция УстановитьЗначениеСвойстваЭлемента(Элемент,Свойство,Значение)
	Попытка
		Элемент[Свойство] = Значение;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции
//Бизтех Коваль 13.01.2024 ++
Функция ПриВызовеИзТаблицы(Документ,ИмяТаблицы, ВыбраннаяСтрока, Колонка) Экспорт
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат истина;
	конецЕсли;
	
	Попытка
		ИмяКолонки = Колонка.ТекущаяКолонка.Имя;
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	БлокируемыеКолонки = Новый Массив;
	БлокируемыеКолонки.Добавить("Сумма");
	БлокируемыеКолонки.Добавить("СуммаВсего");
	БлокируемыеКолонки.Добавить("Нормочас");
	БлокируемыеКолонки.Добавить("ПроцентСкидки");
	БлокируемыеКолонки.Добавить("СуммаСкидки");
	
	Если ИмяТаблицы <> "Товары" Тогда
		БлокируемыеКолонки.Добавить("Цена");
	КОнецЕсли;
	
	
	ИсключенияРаботы = Новый Массив; 
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00015442")); //Лакокрасочные материалы
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00061220")); //СЛЕСАРНЫЕ РАБОТЫ 
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00082349")); //Малярно-кузовной ремонт
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00085402")); //Перешив руля
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00082170")); //Ремонт сидения
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00085406")); //Мойка автомобиля (Комплекс)
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00085405")); //Мойка автомобиля (кузов)
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00080973")); //Химчистка салона автомобиля
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00044658")); //Перетяжка кожей (субподряд)
	ИсключенияРаботы.Добавить(Справочники.Автоработы.НайтиПоКоду("ЦБ00085408")); //Перетяжка потолка
	
	ПраваПользователя = глПрава;
	ЕстьЛиПраво = обПраво(ПланыВидовХарактеристик.ПраваИНастройки.НайтиПоКоду("К0002"),ПраваПользователя);
	Если ЕстьЛиПраво <> Истина Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		ТекущаяНоменклатураАвторабота = ВыбраннаяСтрока.Работа;
	Исключение
		ТекущаяНоменклатураАвторабота = ВыбраннаяСтрока.Номенклатура;
	КонецПопытки;
	
	Если БлокируемыеКолонки.Найти(ИмяКолонки) = Неопределено Тогда
		Возврат Истина;
	Иначе
		Если ЗначениеЗаполнено(ТекущаяНоменклатураАвторабота) И ИсключенияРаботы.Найти(ТекущаяНоменклатураАвторабота) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//Бизтех Коваль 13.01.2024 --
